NXP/GenAVB_TSN-rtos-apps/boards/evkbimxrt1050/demo_apps/avb_tsn/common/pin_mux.c
/* FUNCTION ************************************************************************************************************
 *
 * Function Name : BOARD_InitMCRPins
 * Description   : Configures pin routing and optionally pin electrical features.
 *
 * END ****************************************************************************************************************/
void BOARD_InitMCRPins(void) {
  CLOCK_EnableClock(kCLOCK_Iomuxc);           /* iomuxc clock (iomuxc_clk_enable): 0x03u */

#ifdef CONFIG_APP_MCR
  IOMUXC_SetPinMux(
      IOMUXC_GPIO_AD_B0_09_GPT2_CLK,          /* GPIO_AD_B0_09 is configured as GPT2 Clk Input */
      0U);
#else
  IOMUXC_SetPinMux(
      IOMUXC_GPIO_AD_B0_09_GPIO1_IO09,        /* GPIO_AD_B0_09 is configured as GPIO1_IO09 */
      0U);                                    /* Software Input On Field: Input Path is determined by functionality */
#endif
#ifdef CONFIG_APP_MCR
  IOMUXC_SetPinMux(
      IOMUXC_GPIO_AD_B1_03_GPIO1_IO19,        /* GPIO_AD_B1_03 is configured as ENET_RST */
      0U);
  IOMUXC_SetPinMux(
      IOMUXC_GPIO_SD_B0_05_CCM_CLKO2,         /* GPIO_SD_B0_05 is configured as Observability Clock 2 Output */
      0U);
#endif

#ifdef CONFIG_APP_MCR
  IOMUXC_SetPinConfig(
      IOMUXC_GPIO_SD_B0_05_CCM_CLKO2,
      0x10B0u);

  IOMUXC_SetPinConfig(
      IOMUXC_GPIO_AD_B1_03_GPIO1_IO19,
      0x10B0u);

  IOMUXC_SetPinConfig(
      IOMUXC_GPIO_AD_B0_09_GPT2_CLK,
      0x10B0u);
#else
  IOMUXC_SetPinConfig(
      IOMUXC_GPIO_AD_B0_09_GPIO1_IO09,        /* GPIO_AD_B0_09 PAD functional properties : */
      0xB0A9u);                               /* Slew Rate Field: Fast Slew Rate
                                                 Drive Strength Field: R0/5
                                                 Speed Field: medium(100MHz)
                                                 Open Drain Enable Field: Open Drain Disabled
                                                 Pull / Keep Enable Field: Pull/Keeper Enabled
                                                 Pull / Keep Select Field: Pull
                                                 Pull Up / Down Config. Field: 100K Ohm Pull Up
                                                 Hyst. Enable Field: Hysteresis Disabled */
#endif
}

/*
 * TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
 BOARD_InitLPUART:
 - options: {callFromInitBoot: 'true', coreID: core0, enableClock: 'true'}
 - pin_list:
   - {pin_num: K14, peripheral: LPUART1, signal: TX, pin_signal: GPIO_AD_B0_12}
   - {pin_num: L14, peripheral: LPUART1, signal: RX, pin_signal: GPIO_AD_B0_13}
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS ***********
 */

/* FUNCTION ************************************************************************************************************
 *
 * Function Name : BOARD_InitLPUART
 *
 * END ****************************************************************************************************************/
void BOARD_InitLPUART(void)
{
    CLOCK_EnableClock(kCLOCK_Iomuxc); /* iomuxc clock (iomuxc_clk_enable): 0x03u */

#if FSL_IOMUXC_DRIVER_VERSION >= MAKE_VERSION(2, 0, 3)
    IOMUXC_SetPinMux(
          IOMUXC_GPIO_AD_B0_12_LPUART1_TXD, /* GPIO_AD_B0_12 is configured as LPUART1_TX */
          0U); /* Software Input On Field: Input Path is determined by functionality */
#else
    IOMUXC_SetPinConfig(
          IOMUXC_GPIO_AD_B0_12_LPUART1_TX,
          0x10B0U); 
#endif
#if FSL_IOMUXC_DRIVER_VERSION >= MAKE_VERSION(2, 0, 3)
    IOMUXC_SetPinMux(
          IOMUXC_GPIO_AD_B0_13_LPUART1_RXD, /* GPIO_AD_B0_13 is configured as LPUART1_RX */
          0U); /* Software Input On Field: Input Path is determined by functionality */
#else
    IOMUXC_SetPinConfig(
          IOMUXC_GPIO_AD_B0_13_LPUART1_RX,
          0x10B0U); 
#endif
}

/***********************************************************************************************************************
 * EOF
 **********************************************************************************************************************/
